---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.FabricAreaType
source: html/2f23e52f-2632-2437-f692-f34dd24bdc54.htm
---
# FabricAreaType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.